'''
购买1级石头
'''

11_value = 0.75 # 1颗1级石头消耗0.75金
11_value_diamand = 8 # 1颗1级石头同时还需要消耗8颗钻石


'''
1级合成3级
'''
11_to_13 = 12 # 1颗1级石头编程1颗3级石头，需要消耗12颗1级石头
11_to_13_gold = 0.39 # 同时还需要消耗0.39金
11_to_13_vit = 10 # 同事还需要消耗10点体力

'''
3级合成4级
'''
13_to_14 = 16 # 1颗三级石头合成1颗4级石头，需要消耗16个和1级石头
13_to_14_gold = 0.897 # 1颗三级石头编程1颗4级石头，需要消耗0.897金子
13_to_14_vit = 10 
13_to_14_rate = 0.4878 # 3级合成4级成功率不是百分之百,如果失败会损失16颗1级石，但是不消耗体力


'''
4级合成6级
'''
14_to_16 = 12 #1颗4级石头变成6级石头，概率100%，需要消耗12颗4级石头
14_to_16_gold = 19.75 # 需要消耗19.75金o
14_to_16_vit = 10


'''
已知1颗六级石头的市场售价为750金，请问是自己合成石头划算还是直接购买划算
其他数据：
 1颗钻石diamand卖出0.05金
 1点体力vit 可以卖出1金
'''


